{
  "recipes": [
    {
      "title": "Pesto Pasta",
      "description": "This simple pesto pasta dish is quick and easy to make, and bursting with flavor.",
      "directions": [
        "Cook pasta according to package directions.",
        "In a food processor, blend together basil, garlic, pine nuts, and Parmesan cheese until smooth.",
        "Slowly drizzle in olive oil and blend until mixture is well combined and has a smooth consistency.",
        "Toss pasta with pesto sauce and top with additional Parmesan cheese."
      ],
      "ingredients": [
        "1 pound pasta",
        "2 cups fresh basil leaves",
        "3 cloves garlic, peeled",
        "1/2 cup pine nuts",
        "1/2 cup grated Parmesan cheese",
        "1/2 cup olive oil"
      ]
    },
    {
      "title": "Chicken Stir Fry",
      "description": "This delicious chicken stir fry is packed with vegetables and protein, and is perfect for a healthy weeknight dinner.",
      "directions": [
        "In a wok or large skillet, heat oil over high heat.",
        "Add chicken and stir-fry until browned and cooked through, about 5 minutes.",
        "Add vegetables and stir-fry until crisp-tender, about 3 minutes.",
        "In a small bowl, whisk together soy sauce, rice vinegar, honey, and cornstarch until smooth.",
        "Pour sauce over stir fry and toss to coat. Cook for an additional 1-2 minutes, until sauce has thickened and vegetables are coated."
      ],
      "ingredients": [
        "1 pound boneless, skinless chicken breasts, cut into thin strips",
        "2 cups mixed vegetables (such as bell peppers, snow peas, carrots, and onions)",
        "2 tablespoons vegetable oil",
        "2 tablespoons soy sauce",
        "1 tablespoon rice vinegar",
        "1 tablespoon honey",
        "1 teaspoon cornstarch"
      ]
    },
    {
      "title": "Spaghetti and Meatballs",
      "description": "This classic Italian dish is always a crowd-pleaser, with tender meatballs and a rich tomato sauce over a bed of spaghetti.",
      "directions": [
        "Preheat oven to 350°F.",
        "In a large bowl, mix together ground beef, bread crumbs, Parmesan cheese, garlic, egg, salt, and pepper.",
        "Form mixture into small meatballs and place on a baking sheet.",
        "Bake for 20-25 minutes, until meatballs are browned and cooked through.",
        "In a large pot, bring tomato sauce to a simmer over medium heat.",
        "Add meatballs to the pot and simmer for an additional 10-15 minutes, until heated through.",
        "Meanwhile, cook spaghetti according to package directions.",
        "Serve spaghetti with meatballs and sauce on top."
      ],
      "ingredients": [
        "1 pound ground beef",
        "1/2 cup bread crumbs",
        "1/2 cup grated Parmesan cheese",
        "2 cloves garlic, minced",
        "1 egg, beaten",
        "1 teaspoon salt",
        "1/2 teaspoon black pepper",
        "1 jar tomato sauce",
        "1 pound spaghetti"
      ]
    }
  ]
}
